TalhaErennY/Project-Chimera/Appli/Drivers/Src/stm32h7sxx_eth_driver.c
/*
 * stm32h7sxx_eth_driver.c
 *
 *  Created on: 7 Haz 2026
 *      Author: talha
 */

#include "stm32h7sxx_eth_driver.h"
#include "stm32h7sxx_gpio_driver.h"
#include "stm32h7sxx.h"

/******************************************************************************************************
 * 								Private Driver Variables
 ******************************************************************************************************/

/*
 * RX Descriptors and RX Buffers
 *
 * These variables are placed into .eth_dma section
 * The linker script places .eth_dma at 0x24040000
 * The MPU will later mark this region as non-cacheable
 */
__attribute__((used, section(".eth_dma"), aligned(32)))
ETH_DMADesc_t ETH_RX_Desc[ETH_RX_DESC_CNT];

__attribute__((used, section(".eth_dma"), aligned(32)))
uint8_t ETH_RX_Buffers[ETH_RX_DESC_CNT][ETH_RX_BUF_SIZE];

/*
 * Current RX descriptor index.
 *
 * This variable is private to Ethernet driver.
 */
static uint32_t ETH_RX_CurrentDesc = 0U;

/******************************************************************************************************
 * 								Private Helper Functions
 ******************************************************************************************************/

/*
 * DSB = Data Synchronization Barrier
 *
 * Finish memory/system register operations before continuing
 */
static void CPU_DSB(void){
	__asm volatile ("dsb 0xF" ::: "memory");
}

/*
 * ISB = Instruction Synchronization Barrier
 *
 * Reload CPU execution pipeline after system control changes
 */
static void CPU_ISB(void){
	__asm volatile ("isb 0xF" ::: "memory");
}

/****************************************************************************
 * @fn				- ETH_MDIO_WaitReady
 *
 * @brief			- This internal helper waits until MDIO interface becomes ready
 *
 * @param[in]		- none
 * @param[in]		-
 * @param[in]		-
 *
 * @return			- 1 if MDIO interface is ready, 0 if timeout occurs
 *
 * @Note			- ETH_MACMDIOAR.MB bit is set while an MDIO transaction is ongoing.
 * 					- This function is private to this driver file.
 *					-
 *
 */
static uint8_t ETH_MDIO_WaitReady(void){
	uint32_t timeout = ETH_TIMEOUT_VALUE;

	while((ETH->MACMDIOAR & (1UL << ETH_MACMDIOAR_MB)) != 0U){
		if(--timeout == 0U){
			return 0U;
		}
	}

	return 1U;
}

/******************************************************************************************************
 * 								Peripheral Clock / Interface / Reset Setup
 ******************************************************************************************************/

/************************************************************************************
 * @fn				- ETH_PeriClockControl
 *
 * @brief			- This function enables or disables peripheral clock for ETH MAC,
 * 					  ETH TX and ETH RX blocks
 *
 * @param[in]		- ENABLE or DISABLE macros
 * @param[in]		-
 * @param[in]		-
 *
 * @return			- none
 *
 * @Note			- For ENorDI selection, see ENABLE / DISABLE macros in stm32h7sxx.h.
 *					- Ethernet peripheral has separate clock enable bits for MAC,
 * 					  TX and RX paths.
 * 					- All three clocks must be enabled before using ETH registers.
 *					-
 *
 */
void ETH_PeriClockControl(uint8_t ENorDI){
	if(ENorDI == ENABLE){
		ETH1_PCLK_EN();
	}else{
		ETH1_PCLK_DI();
	}
}

/*********************************************************************************
 * @fn				- ETH_GPIO_RMII_Init
 *
 * @brief			- This function configures GPIO pins used by Ethernet RMII interface
 *
 * @param[in]		- none
 * @param[in]		-
 * @param[in]		-
 *
 * @return			- none
 *
 * @Note			- RMII pins on NUCLEO-H7S3L8:
 * 					- PB6  -> ETH_REF_CLK
 *					- PA2  -> ETH_MDIO
 *					- PG6  -> ETH_MDC
 *					- PA7  -> ETH_CRS_DV
 *					- PG4  -> ETH_RXD0
 *					- PG5  -> ETH_RXD1
 *					- PG11 -> ETH_TX_EN
 *					- PG13 -> ETH_TXD0
 *					- PG12 -> ETH_TXD1
 *
 */
void ETH_GPIO_RMII_Init(void){
	GPIO_Handle_t GPIOETH;

	//Enable GPIO clocks
	GPIO_PeriClockControl(GPIOA, ENABLE);
	GPIO_PeriClockControl(GPIOB, ENABLE);
	GPIO_PeriClockControl(GPIOG, ENABLE);

	//GPIO Configurations
	GPIOETH.GPIO_PinConfig.GPIO_PinMode = GPIO_MODE_AF;
	GPIOETH.GPIO_PinConfig.GPIO_PinOPType = GPIO_OP_TYPE_PP;
	GPIOETH.GPIO_PinConfig.GPIO_PinSpeed = GPIO_OSPEED_VHIGH;
	GPIOETH.GPIO_PinConfig.GPIO_PinPuPdCtrl = GPIO_PUPD_NONE;
	GPIOETH.GPIO_PinConfig.GPIO_PinAltFuncMode = 11U;				//For ethernet related things

	/*
	 * GPIOA Pins:
	 *
	 * PA2 -> ETH_MDIO
	 * PA7 -> ETH_CRS_DV
	 */
	GPIOETH.pGPIOx = GPIOA;

	GPIOETH.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_2;
	GPIO_Init(&GPIOETH);

	GPIOETH.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_7;
	GPIO_Init(&GPIOETH);

	/*
	 * GPIOB Pin:
	 *
	 * PB6 -> ETH_REF_CLK
	 */
	GPIOETH.pGPIOx = GPIOB;

	GPIOETH.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_6;
	GPIO_Init(&GPIOETH);

	/*
	 * GPIOG Pins:
	 *
	 * PG4  -> ETH_RXD0
	 * PG5  -> ETH_RXD1
	 * PG6  -> ETH_MDC
	 * PG11 -> ETH_TX_EN
	 * PG12 -> ETH_TXD1
	 * PG13 -> ETH_TXD0
	 */
	GPIOETH.pGPIOx = GPIOG;

	GPIOETH.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_4;
	GPIO_Init(&GPIOETH);

	GPIOETH.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_5;
	GPIO_Init(&GPIOETH);

	GPIOETH.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_6;
	GPIO_Init(&GPIOETH);

	GPIOETH.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_11;
	GPIO_Init(&GPIOETH);

	GPIOETH.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_12;
	GPIO_Init(&GPIOETH);

	GPIOETH.GPIO_PinConfig.GPIO_PinNumber = GPIO_PIN_NO_13;
	GPIO_Init(&GPIOETH);
}

/****************************************************************************
 * @fn				- ETH_SelectRMII
 *
 * @brief			- This function selects RMII as the Ethernet PHY interface
 *
 * @param[in]		- none
 * @param[in]		-
 * @param[in]		-
 *
 * @return			- none
 *
 * @Note			- On STM32H7Rx/7Sx, Ethernet PHY interface is selected using
 * 					  SBS_PMCR.ETH_PHYSEL[2:0].
 * 					- ETH_PHYSEL = 100 selects RMII.
 *					- This function must be called before Ethernet software reset.
 *					- (GMII/MII support will come soon...)
 *
 */
void ETH_SelectRMII(void){
	SBS_PCLK_EN();
	/*
	 * Clear ETH_PHYSEL[2:0] field first.
	 */
	SBS->PMCR &= ~(0x7UL << SBS_PMCR_ETH_PHYSEL);

