TalhaErennY/Project-Chimera/Appli/Drivers/Src/stm32h7sxx_eth_driver.c
	/*
	 * Select RMII mode: ETH_PHYSEL[2:0] = 100.
	 */
	SBS->PMCR |= ((uint32_t)SBS_PMCR_ETH_PHYSEL_RMII << SBS_PMCR_ETH_PHYSEL);
}

/****************************************************************************
 * @fn				- ETH_SoftwareReset
 *
 * @brief			- This function performs Ethernet DMA software reset
 *
 * @param[in]		- none
 * @param[in]		-
 * @param[in]		-
 *
 * @return			- 1 for Successful, 0 for not
 *
 * @Note			- ETH_DMAMR.SWR bit is set by software and cleared by hardware
 * 					  when reset is completed.
 * 					- If this function gets stuck, ETH clock or RMII reference clock
 * 					  may be missing.
 *					-
 *
 */
uint8_t ETH_SoftwareReset(void){
	uint32_t timeout = ETH_TIMEOUT_VALUE;

	ETH->DMAMR |= (1UL << ETH_DMAMR_SWR);

	while((ETH->DMAMR & (1UL << ETH_DMAMR_SWR)) != 0U){
		if(--timeout == 0U){
			return 0U;
		}
	}

	return 1U;
}

/******************************************************************************************************
 * 								MPU / Cache Configuration
 ******************************************************************************************************/

/****************************************************************************
 * @fn				- ETH_MPU_ConfigNonCacheable
 *
 * @brief			- This function configures a 16 KB non-cacheable MPU region
 * 					  for Ethernet DMA descriptors and buffers
 *
 * @param[in]		- none
 * @param[in]		-
 * @param[in]		-
 *
 * @return			- none
 *
 * @Note			- Ethernet DMA writes RX packets directly into RAM.
 * 					- If RX buffers are cacheable, CPU may read old cached data.
 *					- This function maps 0x24040000 - 0x24043FFF as normal,
 *					  shareable, non-cacheable, non-executable memory.
 *
 */
void ETH_MPU_ConfigNonCacheable(void){
	/*
	 * Disable MPU before changing region configuration
	 */
	MPU->CTRL &= ~(1UL << MPU_CTRL_ENABLE);

	CPU_DSB();
	CPU_ISB();

	/*
	 * Select MPU region number 0
	 */
	MPU->RNR = 0U;

	/*
	 * Region base address
	 *
	 * ETH_DMA_RAM starts at 0x24040000
	 * Size: 16 KB (0x4000)
	 * Alignment = 32 bytes
	 */
	MPU->RBAR = 0x24040000UL;

	/*
	 * MPU_RASR configuration:
	 *
	 * XN	  = 1		Execute Never: Never execute instructions from this buffer region.
	 * AP	  = 011		Full access
	 * TEX	  = 001		Normal memory type
	 * S	  = 1		Shareable: For DMA-shared memory, this memory is shared between CPU and DMA
	 * C	  = 0		Non-cacheable
	 * B	  = 0		Non-bufferable
	 * SIZE	  = 13		2^(size+1) -> 16KB with 13
	 * ENABLE = 1		Enable this MPU region
	 */
	MPU->RASR =
			((1UL  << MPU_RASR_XN)   |
			 (3UL  << MPU_RASR_AP)   |
			 (1UL  << MPU_RASR_TEX)  |
			 (1UL  << MPU_RASR_S)	 |
			 (13UL << MPU_RASR_SIZE) |
			 (1UL  << MPU_RASR_ENABLE));

	/*
	 * Enable MPU
	 */
	MPU->CTRL = ((1UL << MPU_CTRL_ENABLE) | (1UL << MPU_CTRL_PRIVDEFENA));

	CPU_DSB();
	CPU_ISB();
}

/******************************************************************************************************
 * 								MAC Configuration
 ******************************************************************************************************/

/****************************************************************************
 * @fn				- ETH_SetMACAddress
 *
 * @brief			- This function programs MAC address 0 into Ethernet MAC registers
 *
 * @param[in]		- pointer to 6-byte MAC address array
 * @param[in]		-
 * @param[in]		-
 *
 * @return			- none
 *
 * @Note			- Example MAC address: 02:00:00:00:00:01
 * 					- 0x02 as first byte means locally administered unicast MAC.
 *					-
 *
 */
void ETH_SetMACAddress(uint8_t *pMACAddr){
	if(pMACAddr == 0) return;

	/*
	 * MACA0LR contains MAC address byte 0-3
	 */
	ETH->MACA0LR = (((uint32_t)pMACAddr[0])		  |
				    ((uint32_t)pMACAddr[1] << 8)  |
				    ((uint32_t)pMACAddr[2] << 16) |
				    ((uint32_t)pMACAddr[3] << 24));

	/*
	 * MACA0HR contains MAC address bytes 4-5
	 *
	 * Bit 31 is address enable bit
	 */
	ETH->MACA0HR = (((uint32_t)pMACAddr[4]) 	  |
					((uint32_t)pMACAddr[5] << 8)  |
					(1UL << 31));
}

/****************************************************************************
 * @fn				- ETH_MAC_FilterConfig
 *
 * @brief			- This function configures MAC packet filtering
 *
 * @param[in]		- Value: pre-shifted bit value to be written
 * @param[in]		- ModeMask: selection from @ETH_MACPFR_FILTERS mask macros
 * @param[in]		-
 *
 * @return			- none
 *
 * @Note			-
 * 					-
 *					-
 *
 */
void ETH_MAC_FilterConfig(uint32_t Value, uint32_t FilterMask){
	ETH->MACPFR &= ~(FilterMask);
	ETH->MACPFR |= (Value & FilterMask);
}

/****************************************************************************
 * @fn				- ETH_MAC_OPModeConfig
 *
 * @brief			- The MAC Configuration register establishes the operating mode of the MAC.
 *
 * @param[in]		- Value: pre-shifted bit value to be written
 * @param[in]		- ModeMask: selection from @ETH_MACCR_MODES mask macros
 * @param[in]		-
 *
 * @return			- none
 *
 * @Note			- DMA should be started before enabling MAC.
 * 					- This sets ETH_MACCR bits.
 *					-
 *
 */
void ETH_MAC_OPModeConfig(uint32_t Value, uint32_t ModeMask){
	ETH->MACCR &= ~(ModeMask);
	ETH->MACCR |= (Value & ModeMask);
}

/******************************************************************************************************
 * 								MTL Configuration
 ******************************************************************************************************/
/****************************************************************************
 * @fn				- ETH_MTL_RXQueueConfig
 *
 * @brief			- This function configures Ethernet MTL RX queue
 *
 * @param[in]		- none
 * @param[in]		-
 * @param[in]		-
 *
 * @return			- none
 *
 * @Note			- Store-and-forward mode is used for simpler RX operation.
 * 					- In this mode, MTL stores a complete frame before forwarding
 * 					  it to DMA.
 *					-
 *
 */
void ETH_MTL_RXQueueConfig(uint32_t Value, uint32_t ModeMask){
	ETH->MTLRXQOMR &= ~(ModeMask);
	ETH->MTLRXQOMR |= (Value & ModeMask);
}

/******************************************************************************************************
 * 								DMA Descriptor / RX Path Configuration
 ******************************************************************************************************/

/****************************************************************************
 * @fn				- ETH_RXDesc_Init
 *
 * @brief			- This function initializes Ethernet RX DMA descriptors and buffers
 *
 * @param[in]		- none
 * @param[in]		-
 * @param[in]		-
 *
 * @return			- none
 *
 * @Note			- Each RX descriptor points to one RX buffer.
 * 					- DESC0 contains buffer address.
 *					- DESC3 is configured with OWN, IOC and BUF1V bits.
 *					- OWN = 1 gives the descriptor to DMA.
 *
 */
void ETH_RXDesc_Init(void){
	for(uint32_t i = 0U; i < ETH_RX_DESC_CNT; i++){
		/*
		 * Clear RX Buffer
		 */
		for(uint32_t j = 0U; j < ETH_RX_BUF_SIZE; j++){
				ETH_RX_Buffers[i][j] = 0U;
		}

