TalhaErennY/Project-Chimera/Appli/Drivers/Src/stm32h7sxx_eth_driver.c
		/*
		 * RDES0 = Buffer 1 address pointer
		 */
		ETH_RX_Desc[i].DESC0 = (uint32_t)&ETH_RX_Buffers[i][0];

		/*
		 * Buffer 2 is 0
		 */
		ETH_RX_Desc[i].DESC1 = 0U;
		ETH_RX_Desc[i].DESC2 = 0U;

		/*
		 * Descriptor to DMA
		 *
		 * OWN = Dma Owns descriptor
		 * IOC = Interrupt on completion later
		 * BUF1V = Buffer 1 address valid
		 */
		ETH_RX_Desc[i].DESC3 = ETH_RDES3_OWN | ETH_RDES3_IOC | ETH_RDES3_BUF1V;

	}
	//Check if the descriptor writes are complete before DMA uses them
	CPU_DSB();
}

/****************************************************************************
 * @fn				- ETH_DMA_RXConfig
 *
 * @brief			- This function configures Ethernet RX DMA descriptor list
 * 					  address, ring length, tail pointer and RX buffer size
 *
 * @param[in]		- none
 * @param[in]		-
 * @param[in]		-
 *
 * @return			- none
 *
 * @Note			- RX descriptors must already be initialized before calling
 * 					  this function.
 * 					- ETH_RX_Desc is placed in non-cacheable RAM at 0x24040000.
 *					-
 *
 */
void ETH_DMA_RXConfig(void){
	/*
	 * Rx descriptor ring length register ETH_DMACRXRLR
	 */
	ETH->DMACRXRLR = (ETH_RX_DESC_CNT - 1U);

	/*
	 * Give RX Descriptor list base address to DMA
	 *
	 * DMACRXDLAR = address list of first rx descriptor
	 */
	ETH->DMACRXDLAR = (uint32_t)&ETH_RX_Desc[0];

	/*
	 * RX Descriptor tail pointer
	 */
	ETH->DMACRXDTPR = (uint32_t)&ETH_RX_Desc[ETH_RX_DESC_CNT - 1U];

	/*
	 * RX Buffer Size
	 *
	 * RBSZ field starts at bit 1
	 * ETH_RX_BUF_SIZE = 1536 bytes
	 */
	ETH->DMACRXCR &= ~(ETH_DMACRXCR_RBSZ_MASK);
	ETH->DMACRXCR |= ((uint32_t)ETH_RX_BUF_SIZE << ETH_DMACRXCR_RBSZ);
}

/****************************************************************************
 * @fn				- ETH_DMA_RXStart
 *
 * @brief			- This function starts Ethernet RX DMA
 *
 * @param[in]		- none
 * @param[in]		-
 * @param[in]		-
 *
 * @return			- none
 *
 * @Note			- RX descriptors must be owned by DMA before starting RX DMA.
 * 					- This sets ETH_DMACRXCR.SR bit.
 *					-
 *
 */
void ETH_DMA_RXStart(void){
	ETH->DMACRXCR |= (1UL << ETH_DMACRXCR_SR);
}

/****************************************************************************
 * @fn				- ETH_ReadRawFrame
 *
 * @brief			- This function checks current RX descriptor and returns
 * 					  received raw Ethernet frame pointer and length if available
 *
 * @param[in]		- pointer to frame pointer variable
 * @param[in]		- pointer to frame length variable
 * @param[in]		-
 *
 * @return			- 1 if a frame is available, 0 if no frame is available
 *
 * @Note			- This is a polling function for early Ethernet RX testing.
 * 					- After reading the frame, user must call
 * 					  ETH_ReleaseRXDescriptor().
 *					-
 *
 */
uint8_t ETH_ReadRawFrame(uint8_t **ppFrame, uint32_t *pLength){
	uint32_t desc3;
	ETH_DMADesc_t *pDesc;

	if((ppFrame == 0U) || (pLength == 0U)) return 0U;

	pDesc = &ETH_RX_Desc[ETH_RX_CurrentDesc];
	desc3 = pDesc->DESC3;

	/*
	 * OWN = 1, DMA still owns Descriptor
	 */
	if((desc3 & ETH_RDES3_OWN) != 0U) return 0U;

	/*
	 * OWN = 0, CPU owns descriptor
	 */
	if((desc3 & ETH_RDES3_WB_ES) != 0U) return 0U;

	/*
	 * DEBUG MODE:
	 * If OWN became 0, we return 1 immediately.
	 * Do not reject because of ES/FD/LD yet.
	 */
	*pLength = (desc3 & ETH_RDES3_WB_PL_MASK);
	*ppFrame = &ETH_RX_Buffers[ETH_RX_CurrentDesc][0];

	return 1U;

}

/****************************************************************************
 * @fn				- ETH_ReleaseRXDescriptor
 *
 * @brief			- This function gives current RX descriptor back to DMA
 *
 * @param[in]		- none
 * @param[in]		-
 * @param[in]		-
 *
 * @return			- none
 *
 * @Note			- This function must be called after CPU finishes reading
 * 					  a received frame.
 * 					- It restores descriptor read-format and sets OWN bit.
 *					-
 *
 */
void ETH_ReleaseRXDescriptor(void){
	ETH_DMADesc_t *pDesc;

	pDesc = &ETH_RX_Desc[ETH_RX_CurrentDesc];

	/*
	 * Restore descriptor read-format
	 */
	pDesc->DESC0 = (uint32_t)&ETH_RX_Buffers[ETH_RX_CurrentDesc][0];
	pDesc->DESC1 = 0U;
	pDesc->DESC2 = 0U;
	pDesc->DESC3 = ETH_RDES3_OWN | ETH_RDES3_BUF1V | ETH_RDES3_IOC;

	CPU_DSB();

	/*
	 * Next descriptor
	 */
	ETH_RX_CurrentDesc++;

	if(ETH_RX_CurrentDesc >= ETH_RX_DESC_CNT){
		ETH_RX_CurrentDesc = 0U;
	}

	/*
	 * Notify the DMA that descriptors are available again
	 *
	 * Writing tail pointer is used to resume DMA if it suspended because
	 * no descriptor was available.
	 */
	ETH->DMACRXDTPR = (uint32_t)&ETH_RX_Desc[ETH_RX_DESC_CNT - 1U];

}

/******************************************************************************************************
 * 								UDP / IPv4 Parser Helper Functions
 ******************************************************************************************************/
/****************************************************************************
 * @fn				- ETH_FrameTypeCheck
 *
 * @brief			- This function checks and returns the EtherType field of
 * 					  a raw Ethernet frame
 *
 * @param[in]		- pointer to raw Ethernet frame buffer
 * @param[in]		- raw Ethernet frame length
 * @param[in]		-
 *
 * @return			- EtherType value, 0 if frame is invalid
 *
 * @Note			- EtherType is located at byte 12 and byte 13 of the
 * 					  Ethernet frame.
 * 					- Example values:
 * 					  0x0800 = IPv4
 * 					  0x0806 = ARP
 * 					  0x86DD = IPv6
 *
 */
uint16_t ETH_FrameTypeCheck(uint8_t *pFrame, uint32_t FrameLength){
	uint16_t ethertype;

	if(pFrame == 0U) return 0U;

	/*
	 * Ethernet header length is 14 bytes
	 *
	 * Ethertype is located at byte 12 and byte 13
	 */
	if(FrameLength < ETH_HEADER_LEN) return 0U;

	ethertype = ((uint16_t)pFrame[12] << 8U) | pFrame[13];

	return ethertype;
}

/****************************************************************************
 * @fn				- ETH_GetUDPPayload
 *
 * @brief			- This function extracts UDP payload pointer and payload
 * 					  length from a raw Ethernet frame
 *
 * @param[in]		- pointer to raw Ethernet frame buffer
 * @param[in]		- raw Ethernet frame length
 * @param[in]		- expected UDP destination port
 * @param[in]		- pointer to payload pointer variable
 * @param[in]		- pointer to payload length variable
 *
 * @return			- 1 if valid UDP payload is found, 0 otherwise
 *
 * @Note			- This function checks IPv4, UDP protocol and destination port.
 * 					- UDP payload is not null-terminated.
 *					- User must use returned payload length.
 *
 */
uint8_t ETH_GetUDPPayload(uint8_t *pFrame, uint32_t FrameLength, uint16_t ExpectedDestPort, uint8_t **ppPayload, uint32_t *pPayloadLength){
	uint32_t ethertype;

	uint8_t ip_headler_len;
	uint8_t ip_protocol;

	uint32_t udp_header_offset;
	uint32_t udp_payload_offset;

