TalhaErennY/Project-Chimera/Appli/Drivers/Src/stm32h7sxx_eth_driver.c
	uint16_t udp_dest_port;
	uint16_t udp_len;

	if((pFrame == 0) || (ppPayload == 0) || (pPayloadLength) == 0) return 0U;

	*ppPayload = 0;
	*pPayloadLength = 0U;

	/*
	 * Check ethernet frame type
	 */
	ethertype = ETH_FrameTypeCheck(pFrame, FrameLength);

	if(ethertype != ETH_TYPE_IPV4) return 0U;

	/*
	 * Minimum Ethernet + IPv4 + UDP header length check
	 */
	if(FrameLength < (ETH_HEADER_LEN + 20U + ETH_UDP_HEADER_LEN)) return 0U;

	/*
	 * IPv4 Header starts after Ethernet Header
	 *
	 * pFrame[14] example:
	 * 0x45 -> Version = 4, IHL = 5
	 */
	ip_headler_len = (pFrame[ETH_HEADER_LEN] & 0x0FU) * 4U;

	if(ip_headler_len < 20U) return 0U;

	if(FrameLength < (ETH_HEADER_LEN + ip_headler_len + ETH_UDP_HEADER_LEN)) return 0U;

	/*
	 * IPv4 protocol field is at offset 9 inside IPv4 Header
	 *
	 * UDP = 17
	 */
	ip_protocol = pFrame[ETH_HEADER_LEN + 9U];

	if(ip_protocol != ETH_IP_PROTOCOL_UDP) return 0U;

	/*
	 * UDP header starts after ethernet header + IPv4 header
	 */
	udp_header_offset = ETH_HEADER_LEN + ip_headler_len;

	/*
	 * UDP Destionation Port is byte 2-3 inside UDP Header
	 */
	udp_dest_port = ((uint16_t)pFrame[udp_header_offset + 2U] << 8U) |
			  	  	 pFrame[udp_header_offset + 3U];

	if(udp_dest_port != ExpectedDestPort) return 0U;

	/*
	 * UDP Lenght is byte 4-5 inside udp header
	 */
	udp_len = ((uint16_t)pFrame[udp_header_offset + 4U] << 8)	|
			   pFrame[udp_header_offset + 5U];

	if(udp_len < ETH_UDP_HEADER_LEN) return 0U;

	udp_payload_offset = udp_header_offset + ETH_UDP_HEADER_LEN;

	//Overflow check
	if((udp_payload_offset + (udp_len - ETH_UDP_HEADER_LEN)) > FrameLength) return 0U;

	*ppPayload = &pFrame[udp_payload_offset];
	*pPayloadLength = (uint32_t)(udp_len - ETH_UDP_HEADER_LEN);

	return 1U;
}

/******************************************************************************************************
 * 								PHY / MDIO Register Access
 ******************************************************************************************************/

/****************************************************************************
 * @fn				- ETH_PHY_Read
 *
 * @brief			- This function reads a 16-bit register from an Ethernet PHY
 * 					  using the MDIO/MDC management interface
 *
 * @param[in]		- PHY address on the MDIO bus
 * @param[in]		- PHY register address to read
 * @param[in]		-
 *
 * @return			- 16-bit PHY register value
 *
 * @Note			- For RegAddr selection, see @PHY_REGISTER_ADDRESSES macros.
 * 					- This function uses Clause 22 MDIO access.
 * 					- If 0xFFFF is returned for all registers, PHY address,
 * 					  RMII GPIO configuration or Ethernet clocks should be checked.
 *					-
 *
 */
uint16_t ETH_PHY_Read(uint8_t PHYAddr, uint8_t RegAddr){
	uint32_t tempreg = 0;

	if(ETH_MDIO_WaitReady() == 0U){
		return 0xFFFFU;
	}

	/*
	 * Clause 22 read transaction:
	 *
	 * C45E = 0
	 * PA   = PHY address
	 * RDA  = PHY register address
	 * CR   = MDC clock range
	 * GOC  = Read command
	 * MB   = 1 starts transaction
	 */
	tempreg |= ((uint32_t)(PHYAddr & 0x1FU) << ETH_MACMDIOAR_PA);
	tempreg |= ((uint32_t)(RegAddr & 0x1FU) << ETH_MACMDIOAR_RDA);
	tempreg |= ((uint32_t)(ETH_MDIO_CSR_CLOCK_RANGE & 0x0FU) << ETH_MACMDIOAR_CR);
	tempreg |= ((uint32_t)(ETH_MDIO_GOC_READ & 0x03U) << ETH_MACMDIOAR_GOC);
	tempreg |= (1UL << ETH_MACMDIOAR_MB);

	ETH->MACMDIOAR = tempreg;

	if(ETH_MDIO_WaitReady() == 0U){
		return 0xFFFFU;
	}

	return ((uint16_t)(ETH->MACMDIODR & 0xFFFFU));
}

/****************************************************************************
 * @fn				- ETH_PHY_Write
 *
 * @brief			- This function writes a 16-bit value to an Ethernet PHY register
 * 					  using the MDIO/MDC management interface
 *
 * @param[in]		- PHY address on the MDIO bus
 * @param[in]		- PHY register address to write
 * @param[in]		- 16-bit value to be written
 *
 * @return			- none
 *
 * @Note			- For RegAddr selection, see @PHY_REGISTER_ADDRESSES macros.
 * 					- This function uses Clause 22 MDIO access.
 * 					- It will be used later for PHY reset, auto-negotiation and
 * 					  speed/duplex configuration.
 *					-
 *
 */
void ETH_PHY_Write(uint8_t PHYAddr, uint8_t RegAddr, uint16_t Value){
	uint32_t tempreg = 0;

	if(ETH_MDIO_WaitReady() == 0U){
		return;
	}

	ETH->MACMDIODR = ((uint32_t)Value & 0xFFFFU);

	/*
	 * Clause 22 write transaction
	 */
	tempreg |= ((uint32_t)(PHYAddr & 0x1FU) << ETH_MACMDIOAR_PA);
	tempreg |= ((uint32_t)(RegAddr & 0x1FU) << ETH_MACMDIOAR_RDA);
	tempreg |= ((uint32_t)(ETH_MDIO_CSR_CLOCK_RANGE & 0x0FU) << ETH_MACMDIOAR_CR);
	tempreg |= ((uint32_t)(ETH_MDIO_GOC_WRITE & 0x03U) << ETH_MACMDIOAR_GOC);
	tempreg |= (1UL << ETH_MACMDIOAR_MB);

	ETH->MACMDIOAR = tempreg;

	(void)ETH_MDIO_WaitReady();
}

/******************************************************************************************************
 * 								PHY Status / Link Helper Functions
 ******************************************************************************************************/

/****************************************************************************
 * @fn				- ETH_PHY_FindAddress
 *
 * @brief			- This function scans all possible PHY addresses and finds the
 * 					  address of the connected Ethernet PHY
 *
 * @param[in]		- pointer to variable where found PHY address will be stored
 * @param[in]		-
 * @param[in]		-
 *
 * @return			- 1 if PHY is found, 0 if no PHY is found
 *
 * @Note			- PHY addresses are in the range 0 to 31.
 * 					- The function checks PHY ID1 and PHY ID2 registers.
 *					-
 *
 */
uint8_t ETH_PHY_FindAddress(uint8_t *pPHYAddr){
	uint8_t addr;
	uint16_t id1;
	uint16_t id2;

	if(pPHYAddr == 0) return 0U;

	for(addr = 0U; addr < 32U; addr++){
		id1 = ETH_PHY_Read(addr, PHY_REG_ID1);
		id2 = ETH_PHY_Read(addr, PHY_REG_ID2);

		if((id1 != 0x0000U) && (id1 != 0xFFFFU) &&
		   (id2 != 0x0000U) && (id2 != 0xFFFFU)){
			*pPHYAddr = addr;
			return 1U;
		}
	}

	return 0U;
}

/****************************************************************************
 * @fn				- ETH_PHY_IsLinkUp
 *
 * @brief			- This function checks whether Ethernet link is up or down
 *
 * @param[in]		- PHY address on the MDIO bus
 * @param[in]		-
 * @param[in]		-
 *
 * @return			- 1 if link is up, 0 if link is down
 *
 * @Note			- For link status bit selection, see @PHY_BSR_BITS macros.
 * 					- PHY Basic Status Register link status bit may be latched.
 * 					- Therefore the register is read twice and the second value
 * 					  is used.
 *					-
 *
 */
uint8_t ETH_PHY_IsLinkUp(uint8_t PHYAddr){
	uint16_t bsr;

