TalhaErennY/Project-Chimera/Appli/Drivers/Src/stm32h7sxx_eth_driver.c
	/*
	 * First read clears possible latched state
	 */
	bsr = ETH_PHY_Read(PHYAddr, PHY_REG_BSR);

	/*
	 * Second read gives current link status
	 */
	bsr = ETH_PHY_Read(PHYAddr, PHY_REG_BSR);

	if(bsr & PHY_BSR_LINK_STATUS){
		return 1U;
	}

	return 0U;
}

/****************************************************************************
 * @fn				- ETH_PHY_IsAutoNegComplete
 *
 * @brief			- This function checks whether PHY auto-negotiation is completed
 *
 * @param[in]		- PHY address on the MDIO bus
 * @param[in]		-
 * @param[in]		-
 *
 * @return			- 1 if auto-negotiation is completed, 0 if not completed
 *
 * @Note			- For auto-negotiation complete bit, see @PHY_BSR_BITS macros.
 * 					- Auto-negotiation is the process where PHY and link partner
 * 					  agree on speed and duplex mode.
 * 					- This function reads the standard PHY Basic Status Register.
 *					-
 *
 */
uint8_t ETH_PHY_IsAutoNegComplete(uint8_t PHYAddr){
	uint16_t bsr;

	bsr = ETH_PHY_Read(PHYAddr, PHY_REG_BSR);
	bsr = ETH_PHY_Read(PHYAddr, PHY_REG_BSR);

	if((bsr & PHY_BSR_AUTO_NEG_COMPLETE) != 0){
		return 1U;
	}

	return 0;
}

/****************************************************************************
 * @fn				- ETH_PHY_WaitForLink
 *
 * @brief			- This function waits until Ethernet PHY link becomes up
 *
 * @param[in]		- PHY address on the MDIO bus
 * @param[in]		- timeout value for blocking wait loop
 * @param[in]		-
 *
 * @return			- 1 if link becomes up, 0 if timeout occurs
 *
 * @Note			- Link up means that the Ethernet cable is connected and the
 * 					  PHY has established a physical link with the other side.
 * 					- If this function returns 0, check Ethernet cable, router/PC
 * 					  port, PHY power and RJ45 LEDs.
 *					-
 *
 */
uint8_t ETH_PHY_WaitForLink(uint8_t PHYAddr, uint32_t timeout){
	while(ETH_PHY_IsLinkUp(PHYAddr) == 0U){
		if(--timeout == 0U){
			return 0U;
		}
	}

	return 1U;
}

/****************************************************************************
 * @fn				- ETH_PHY_WaitAutoNegotiation
 *
 * @brief			- This function waits until PHY auto-negotiation is completed
 *
 * @param[in]		- PHY address on the MDIO bus
 * @param[in]		- timeout value for blocking wait loop
 * @param[in]		-
 *
 * @return			- 1 if auto-negotiation completes, 0 if timeout occurs
 *
 * @Note			- Auto-negotiation decides speed and duplex between PHY and
 * 					  link partner.
 * 					- For exact speed/duplex result, PHY-specific registers will
 * 					  be read later.
 *					-
 *
 */
uint8_t ETH_PHY_WaitAutoNegotiation(uint8_t PHYAddr, uint32_t timeout){
	while(ETH_PHY_IsAutoNegComplete(PHYAddr) == 0U){
		if(--timeout == 0U){
			return 0U;
		}
	}

	return 1U;
}

/******************************************************************************************************
 * 								Debug Helper Functions
 ******************************************************************************************************/

/****************************************************************************
 * @fn				- ETH_GetRXDescBase
 *
 * @brief			- This function returns RX descriptor base address for debugging
 *
 * @param[in]		- none
 * @param[in]		-
 * @param[in]		-
 *
 * @return			- pointer to RX descriptor array
 *
 * @Note			- This function is used only to inspect descriptor address
 * 					  in debugger.
 * 					-
 *					-
 *
 */
ETH_DMADesc_t* ETH_GetRXDescBase(void){
	return ETH_RX_Desc;
}

/****************************************************************************
 * @fn				- ETH_GetRXBufferBase
 *
 * @brief			- This function returns RX buffer base address for debugging
 *
 * @param[in]		- none
 * @param[in]		-
 * @param[in]		-
 *
 * @return			- pointer to first RX buffer byte
 *
 * @Note			- This function is used only to inspect RX buffer address
 * 					  in debugger.
 * 					-
 *					-
 *
 */
uint8_t* ETH_GetRXBufferBase(void){
	return &ETH_RX_Buffers[0][0];
}

/****************************************************************************
 * @fn				- ETH_GetRXDCurrentDescIndex
 *
 * @brief			- This function returns current descriptor index for debugging
 *
 * @param[in]		- none
 * @param[in]		-
 * @param[in]		-
 *
 * @return			- Index Number of Descriptor
 *
 * @Note			- This function is used only to inspect Descriptor index in debugger.
 * 					-
 *					-
 *
 */
uint32_t ETH_GetRXCurrentDescIndex(void){
	return ETH_RX_CurrentDesc;
}

/****************************************************************************
 * @fn				- ETH_GetRXDesc3
 *
 * @brief			- This function returns RX DESC3 for debugging
 *
 * @param[in]		- none
 * @param[in]		-
 * @param[in]		-
 *
 * @return			- Value in DECS3/RDES3
 *
 * @Note			- This function is used only to inspect RX DESC3 in debugger.
 * 					-
 *					-
 *
 */
uint32_t ETH_GetRXDesc3(uint32_t desc_index){
	if(desc_index >= ETH_RX_DESC_CNT)
	{
		return 0U;
	}

	return ETH_RX_Desc[desc_index].DESC3;
}

/****************************************************************************
 * @fn				- ETH_MAC_FilterConfigForTest
 *
 * @brief			- This function configures MAC packet filtering for early RX test
 *
 * @param[in]		- none
 * @param[in]		-
 * @param[in]		-
 *
 * @return			- none
 *
 * @Note			- Promiscuous mode is enabled only for early raw frame testing.
 * 					- Later, this should be replaced with proper MAC filtering.
 *					-
 *
 */
void ETH_MAC_FilterConfigForTest(void){
	/*
	 * PR = 1:
	 * Promiscuous mode. MAC passes all received frames to the application.
	 */
	ETH->MACPFR |= (1UL << ETH_MACPFR_PR);
}

/****************************************************************************
 * @fn				- ETH_MAC_RXEnable
 *
 * @brief			- This function enables Ethernet MAC receiver
 *
 * @param[in]		- none
 * @param[in]		-
 * @param[in]		-
 *
 * @return			- none
 *
 * @Note			- RX DMA should be started before enabling MAC receiver.
 * 					- This sets ETH_MACCR.RE bit.
 *					-
 *
 */
void ETH_MAC_RXEnable(void){
	/*
	 * Test case:
	 *
	 * FES = 1 -> 100 Mbps
	 * DM  = 1 -> Full duplex
	 * RE  = 1 -> Receiver enable
	 */
	ETH->MACCR |= (1UL << ETH_MACCR_FES);
	ETH->MACCR |= (1UL << ETH_MACCR_DM);
	ETH->MACCR |= (1UL << ETH_MACCR_RE);
	ETH->MACCR |= (1UL << ETH_MACCR_TE);
}

/****************************************************************************
 * @fn				- ETH_MTL_RXQueueConfigRSF
 *
 * @brief			- This function configures Ethernet MTL RX queue
 *
 * @param[in]		- none
 * @param[in]		-
 * @param[in]		-
 *
 * @return			- none
 *
 * @Note			- Store-and-forward mode is used for simpler RX operation.
 * 					- In this mode, MTL stores a complete frame before forwarding
 * 					  it to DMA.
 *					-
 *
 */
void ETH_MTL_RXQueueConfigRSF(void){
	/*
	 * RSF = 1:
	 * Receive store-and-forward mode
	 */
	ETH->MTLRXQOMR |= (1UL << ETH_MTLRXQOMR_RSF);
}
